In [63]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from datetime import datetime
import mysql.connector

In [2]:
path_to_file = '../Projects/KPMG_VI_New_raw_data_update_final.xlsx'

In [3]:
xl = pd.ExcelFile(path_to_file)
xl.sheet_names

['Title Sheet',
 'Transactions',
 'NewCustomerList',
 'CustomerDemographic',
 'CustomerAddress']

In [4]:
pd.options.display.max_columns = None
pd.options.display.max_colwidth = 100

In [5]:
xl1 = xl.parse('Transactions')

In [6]:
display(xl1.head(), xl1.tail(), xl1.dtypes, xl1.shape)

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,1,2,2950,2017-02-25,0.0,Approved,Solex,Standard,medium,medium,71.49,53.62,41245.0
1,2,3,3120,2017-05-21,1.0,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,41701.0
2,3,37,402,2017-10-16,0.0,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,36361.0
3,4,88,3135,2017-08-31,0.0,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.10,36145.0
4,5,78,787,2017-10-01,1.0,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48,42226.0

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
19995,19996,51,1018,2017-06-24,1.0,Approved,OHM Cycles,Standard,high,medium,2005.66,1203.40,37823.0
19996,19997,41,127,2017-11-09,1.0,Approved,Solex,Road,medium,medium,416.98,312.74,35560.0
19997,19998,87,2284,2017-04-14,1.0,Approved,OHM Cycles,Standard,medium,medium,1636.90,44.71,40410.0
19998,19999,6,2764,2017-07-03,0.0,Approved,OHM Cycles,Standard,high,medium,227.88,136.73,38216.0
19999,20000,11,1144,2017-09-22,1.0,Approved,Trek Bicycles,Standard,medium,small,1775.81,1580.47,36334.0

transaction_id                      int64
product_id                          int64
customer_id                         int64
transaction_date           datetime64[ns]
online_order                      float64
order_status                       object
brand                              object
product_line                       object
product_class                      object
product_size                       object
list_price                        float64
standard_cost                     float64
product_first_sold_date           float64
dtype: object

(20000, 13)

In [7]:
xl1['transaction_date'].dt.year.unique()

array([2017])

In [8]:
xl1['transaction_id'] = xl1['transaction_id'].astype(str)
xl1['product_id'] = xl1['product_id'].astype(str)
xl1['customer_id'] = xl1['customer_id'].astype(str)

In [9]:
xl1.isna().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

In [10]:
xl1 = xl1.fillna('NA')

In [11]:
xl1.isna().sum()

transaction_id             0
product_id                 0
customer_id                0
transaction_date           0
online_order               0
order_status               0
brand                      0
product_line               0
product_class              0
product_size               0
list_price                 0
standard_cost              0
product_first_sold_date    0
dtype: int64

In [12]:
xl1[xl1.duplicated(keep=False)]

Empty DataFrame
Columns: [transaction_id, product_id, customer_id, transaction_date, online_order, order_status, brand, product_line, product_class, product_size, list_price, standard_cost, product_first_sold_date]
Index: []

In [13]:
xl2 = xl.parse('NewCustomerList')

/var/folders/m_/08q67_2569g7rxl_d8m9kk2r0000gn/T/ipykernel_74338/1458109405.py:1: FutureWarning: Inferring datetime64[ns] from data containing strings is deprecated and will be removed in a future version. To retain the old behavior explicitly pass Series(data, dtype=datetime64[ns])
  xl2 = xl.parse('NewCustomerList')

In [14]:
display(xl2.head(), xl2.tail(), xl2.dtypes, xl2.shape)

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
0,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,14,45 Shopko Center,4500,QLD,Australia,6,0.65,0.8125,1.015625,0.863281,1,1,1.718750
1,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,16,14 Mccormick Park,2113,NSW,Australia,11,0.98,0.9800,1.225000,1.041250,1,1,1.718750
2,Ardelis,Forrester,Female,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,10,5 Colorado Crossing,3505,VIC,Australia,5,0.81,0.8100,0.810000,0.810000,1,1,1.718750
3,Lucine,Stutt,Female,64,1979-01-28,Account Representative III,Manufacturing,Affluent Customer,N,Yes,5,207 Annamark Plaza,4814,QLD,Australia,1,0.42,0.5250,0.525000,0.525000,4,4,1.703125
4,Melinda,Hadlee,Female,34,1965-09-21,Financial Analyst,Financial Services,Affluent Customer,N,No,19,115 Montana Place,2093,NSW,Australia,9,0.67,0.6700,0.837500,0.837500,4,4,1.703125

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
995,Ferdinand,Romanetti,Male,60,1959-10-07,Paralegal,Financial Services,Affluent Customer,N,No,9,2 Sloan Way,2200,NSW,Australia,7,0.78,0.7800,0.7800,0.780000,996,996,0.374
996,Burk,Wortley,Male,22,2001-10-17,Senior Sales Associate,Health,Mass Customer,N,No,6,04 Union Crossing,2196,NSW,Australia,10,0.76,0.7600,0.9500,0.807500,997,997,0.357
997,Melloney,Temby,Female,17,1954-10-05,Budget/Accounting Analyst IV,Financial Services,Affluent Customer,N,Yes,15,33475 Fair Oaks Junction,4702,QLD,Australia,2,0.71,0.8875,0.8875,0.887500,997,997,0.357
998,Dickie,Cubbini,Male,30,1952-12-17,Financial Advisor,Financial Services,Mass Customer,N,Yes,19,57666 Victoria Way,4215,QLD,Australia,2,1.06,1.3250,1.3250,1.126250,997,997,0.357
999,Sylas,Duffill,Male,56,1955-10-02,Staff Accountant IV,Property,Mass Customer,N,Yes,14,21875 Grover Drive,2010,NSW,Australia,9,1.00,1.2500,1.5625,1.328125,1000,1000,0.340

first_name                                     object
last_name                                      object
gender                                         object
past_3_years_bike_related_purchases             int64
DOB                                    datetime64[ns]
job_title                                      object
job_industry_category                          object
wealth_segment                                 object
deceased_indicator                             object
owns_car                                       object
tenure                                          int64
address                                        object
postcode                                        int64
state                                          object
country                                        object
property_valuation                              int64
Unnamed: 16                                   float64
Unnamed: 17                                   float64
Unnamed: 18                                   float64
Unnamed: 19                                   float64
Unnamed: 20                                     int64
Rank                                            int64
Value                                         float64
dtype: object

(1000, 23)

In [15]:
xl2['Rank'] = xl2['Rank'].astype(str)

In [16]:
columns_to_drop = ['Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18', 'Unnamed: 19', 'Unnamed: 20']
xl2 = xl2.drop(columns=columns_to_drop, axis=1)

In [17]:
xl2['DOB'] = pd.to_datetime(xl2['DOB'], errors='coerce')

In [18]:
xl2.isna().sum()

first_name                               0
last_name                               29
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     17
job_title                              106
job_industry_category                  165
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
address                                  0
postcode                                 0
state                                    0
country                                  0
property_valuation                       0
Rank                                     0
Value                                    0
dtype: int64

In [19]:
xl2['DOB'] = xl2['DOB'].fillna(pd.to_datetime('1900-01-01'))

In [20]:
xl2 = xl2.fillna('NA')

In [21]:
xl2.isna().sum()

first_name                             0
last_name                              0
gender                                 0
past_3_years_bike_related_purchases    0
DOB                                    0
job_title                              0
job_industry_category                  0
wealth_segment                         0
deceased_indicator                     0
owns_car                               0
tenure                                 0
address                                0
postcode                               0
state                                  0
country                                0
property_valuation                     0
Rank                                   0
Value                                  0
dtype: int64

In [22]:
xl2[xl2.duplicated(keep=False)]

Empty DataFrame
Columns: [first_name, last_name, gender, past_3_years_bike_related_purchases, DOB, job_title, job_industry_category, wealth_segment, deceased_indicator, owns_car, tenure, address, postcode, state, country, property_valuation, Rank, Value]
Index: []

In [23]:
# Function to calculate age based on the current date
def calculate_age(birthdate):
    today = datetime.today()
    age = today.year - birthdate.year - ((today.month, today.day) < (birthdate.month, birthdate.day))
    return age

# Calculate and update the ages
xl2['Age'] = xl2['DOB'].apply(calculate_age)

In [24]:
xl2['Age Group'] = pd.cut(xl2['Age'], bins=[21, 35, 45, 65, 85], labels=['21-35', '35-45', '45-65', '65-85'])

In [25]:
xl2['Age Group'] = xl2['Age Group'].astype('object')

In [26]:
xl2.loc[xl2['Age'] == 123, 'Age Group'] = 'NA'

In [27]:
xl2.loc[xl2['Age'] == 123, 'Age'] = 'NA'

In [28]:
xl3 = xl.parse('CustomerDemographic')

/var/folders/m_/08q67_2569g7rxl_d8m9kk2r0000gn/T/ipykernel_74338/4144968063.py:1: FutureWarning: Inferring datetime64[ns] from data containing strings is deprecated and will be removed in a future version. To retain the old behavior explicitly pass Series(data, dtype=datetime64[ns])
  xl3 = xl.parse('CustomerDemographic')

In [29]:
display(xl3.head(), xl3.tail(), xl3.dtypes, xl3.shape)

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,<script>alert('hi')</script>,Yes,16.0
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,2018-02-01 00:00:00,Yes,15.0
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,() { _; } >_[$($())] { touch /tmp/blns.shellshock2.fail; },No,7.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,NIL,Yes,8.0

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
3995,3996,Rosalia,Halgarth,Female,8,1975-08-09,VP Product Management,Health,Mass Customer,N,-100,No,19.0
3996,3997,Blanch,Nisuis,Female,87,2001-07-13,Statistician II,Manufacturing,High Net Worth,N,test,Yes,1.0
3997,3998,Sarene,Woolley,U,60,NaT,Assistant Manager,IT,High Net Worth,N,NaN,No,NaN
3998,3999,Patrizius,NaN,Male,11,1973-10-24,NaN,Manufacturing,Affluent Customer,N,,Yes,10.0
3999,4000,Kippy,Oldland,Male,76,1991-11-05,Software Engineer IV,NaN,Affluent Customer,N,0/0,No,11.0

customer_id                                     int64
first_name                                     object
last_name                                      object
gender                                         object
past_3_years_bike_related_purchases             int64
DOB                                    datetime64[ns]
job_title                                      object
job_industry_category                          object
wealth_segment                                 object
deceased_indicator                             object
default                                        object
owns_car                                       object
tenure                                        float64
dtype: object

(4000, 13)

In [30]:
xl3['customer_id'] = xl3['customer_id'].astype(str)

In [31]:
xl3['DOB'] = pd.to_datetime(xl3['DOB'], errors='coerce')

In [32]:
xl3['DOB'] = xl3['DOB'].fillna(pd.to_datetime('1900-01-01'))

In [33]:
xl3.isna().sum()

customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                      0
job_title                              506
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
default                                302
owns_car                                 0
tenure                                  87
dtype: int64

In [34]:
xl3 = xl3.fillna('NA')

In [35]:
xl3[xl3.duplicated(keep=False)]

Empty DataFrame
Columns: [customer_id, first_name, last_name, gender, past_3_years_bike_related_purchases, DOB, job_title, job_industry_category, wealth_segment, deceased_indicator, default, owns_car, tenure]
Index: []

In [36]:
xl3 = xl3.drop(columns='default', axis=1)

In [37]:
xl3['gender'].unique()

array(['F', 'Male', 'Female', 'U', 'Femal', 'M'], dtype=object)

In [38]:
xl3['gender'] = xl3['gender'].replace({'F': 'Female', 'Femal': 'Female', 'M': 'Male'})

In [39]:
xl3['DOB'].dt.year.unique()

array([1953, 1980, 1954, 1961, 1977, 1966, 1976, 1962, 1973, 1988, 1994,
       1955, 1983, 2000, 1967, 2001, 1995, 1978, 1968, 1957, 1843, 1963,
       1985, 1979, 1981, 1975, 1972, 1992, 1959, 1956, 1996, 1970, 1965,
       2002, 1960, 1974, 1969, 1993, 1989, 1986, 1958, 1984, 1998, 1997,
       1990, 1999, 1982, 1964, 1987, 1900, 1971, 1991, 1944, 1931, 1935,
       1943, 1940])

In [40]:
xl3[xl3['DOB'].dt.year == 1843]

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure
33,34,Jephthah,Bachmann,U,59,1843-12-21,Legal Assistant,IT,Affluent Customer,N,No,20.0

In [41]:
xl3 = xl3.drop(33)

In [42]:
xl3['Age'] = xl3['DOB'].apply(calculate_age)

In [43]:
xl3['Age Group'] = pd.cut(xl3['Age'], bins=[21, 35, 45, 65, 85], labels=['21-35', '35-45', '45-65', '65-85'])

In [44]:
xl3['Age Group'] = xl3['Age Group'].astype('object')

In [45]:
xl3.loc[xl3['Age'] == 123, 'Age Group'] = 'NA'

In [46]:
xl3.loc[xl3['Age'] == 123, 'Age'] = 'NA'

In [47]:
xl4 = xl.parse('CustomerAddress')

In [48]:
display(xl4.head(), xl4.tail(), xl4.dtypes, xl4.shape)

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

,customer_id,address,postcode,state,country,property_valuation
3994,3999,1482 Hauk Trail,3064,VIC,Australia,3
3995,4000,57042 Village Green Point,4511,QLD,Australia,6
3996,4001,87 Crescent Oaks Alley,2756,NSW,Australia,10
3997,4002,8194 Lien Street,4032,QLD,Australia,7
3998,4003,320 Acker Drive,2251,NSW,Australia,7

customer_id            int64
address               object
postcode               int64
state                 object
country               object
property_valuation     int64
dtype: object

(3999, 6)

In [49]:
xl4['postcode'] = xl4['postcode'].astype(str)
xl4['customer_id'] = xl4['customer_id'].astype(str)

In [50]:
xl4['state'].unique()

array(['New South Wales', 'QLD', 'VIC', 'NSW', 'Victoria'], dtype=object)

In [51]:
xl4['state'] = xl4['state'].replace({'New South Wales': 'NSW', 'Victoria': 'VIC'})

In [52]:
xl4.isna().sum()

customer_id           0
address               0
postcode              0
state                 0
country               0
property_valuation    0
dtype: int64

In [53]:
xl4[xl4.duplicated(keep=False)]

Empty DataFrame
Columns: [customer_id, address, postcode, state, country, property_valuation]
Index: []

In [54]:
# Define the Excel writer
with pd.ExcelWriter('Bikes Company.xlsx', engine='xlsxwriter') as writer:
    # Write each DataFrame to a separate sheet in the Excel file
    xl1.to_excel(writer, sheet_name='Transactions', index=False)
    xl2.to_excel(writer, sheet_name='New Customers', index=False)
    xl3.to_excel(writer, sheet_name='Customer Demographic', index=False)
    xl4.to_excel(writer, sheet_name='Customer Address', index=False)

In [66]:
with open('cred_sql.json') as f:
    creds = json.load(f)

In [ ]:
# Replace placeholders with your MySQL server details
host = "host_name"
username = "user_name"
password = "password"

# Create a connection
connection = mysql.connector.connect(
    host=host,
    user=username,
    password=password
)

# Specify the new database name
new_database = "bike_company"

# Create a cursor
cursor = connection.cursor()

# Execute the SQL statement to create the new database
cursor.execute(f"CREATE DATABASE {new_database}")

# Close the cursor
cursor.close()

# Commit changes and close the connection
connection.commit()
connection.close()

In [65]:
# Define the connection parameters
host = "host_name"
username = "user_name"
password = "password"
database = "bike_company"

# Create a connection
connection = create_engine(f"mysql+mysqlconnector://{username}:{password}@{host}/{database}")

data_frames = [xl1, xl2, xl3, xl4]  # List of DataFrames to insert
table_names = ['Transactions', 'NewCustomers', 'CustomerDemographic', 'CustomerAddress']

for i, df in enumerate(data_frames):
    table_name = table_names[i]  # Use the predefined table names
    df.to_sql(table_name, connection, if_exists='replace', index=False)